# while 1 > 0: # True #создание цикла и проверка условия и возврат в начало
#     print("Hello world")
# for i in 1, 2, 3, 4: # переменная i существует только в пределах цикла for.
    # print("Ok") # повторится 4 раза
    # print(i) #переборщик перебирает заявленную последовательность
# list_ = ["One", "Two", "Three"]
# for i in list_:   #"hello": #print(i) # строку так же как и список# можно перебрать в данном случае по элементам (по буквам)
#     if i =="Three":
#         list_.remove(i)
# print(list_) # "Three" удалилось из последовательности
# =========================================================================
# list_ = ["One", "Two", "Three"]
# for i in range(len(list_)): #цикл повторится 5 раз # 0,1,2
#     #print(list_[i])
#     list_[i]= "^_^"
# print(list_)
# ===========================================================================
# list_ = ["One", "Two", "Three"]
# list_2 = [2, 3, 4, 5, 1]
# sum_ = 0
# for i in range(len(list_2)):
#     sum_+= list_2[i]
# print(sum_) #=15
# ============================================================================
for i in range(1,10):# от 1 до 10 не включая последний элемент 10
    # (3 параметра: Start, Stop, End)
    for j in range(1,10):
        print(f" {i} x {j} = {i * j}") #таблица умножения
 # ==============================================================================
dict_ = {"a": 1, "b":2 , "с": 3}
for i in dict_:
    print(i) #  выведет только "a" "b" "c"
    print(i, dict_[i]) #  выведет "a 1" "b 2" "c 3"
#================================================================================
dict_ = {"a": 1, "b":2 , "с": 3}
for i, k in dict_.items():
    print(i,k) # то же самое что и выше
